In [2]:
import pandas as pd

adf = pd.DataFrame(data={'x1': ['A', 'B', 'C'], 'x2' : [1, 2, 3]})

In [3]:
adf

  x1  x2
0  A   1
1  B   2
2  C   3

In [6]:
bdf = pd.DataFrame(data={'x1': ['A', 'B', 'D'], 'x3' : ['T', 'F', 'T']})

In [7]:
bdf

  x1 x3
0  A  T
1  B  F
2  D  T

In [12]:
#Merge adf and bdf based on adf
pd.merge(adf, bdf, how='left')

  x1  x2   x3
0  A   1    T
1  B   2    F
2  C   3  NaN

In [13]:
#Merge adf and bdf based on bdf
pd.merge(adf, bdf, how='right')

  x1   x2 x3
0  A  1.0  T
1  B  2.0  F
2  D  NaN  T

In [14]:
#Merge adf and bdf based on what they have in common
#default value is inner if not defined
pd.merge(adf, bdf, how='inner')

  x1  x2 x3
0  A   1  T
1  B   2  F

In [15]:
pd.merge(adf, bdf)

  x1  x2 x3
0  A   1  T
1  B   2  F

In [18]:
#Union of merge for adf and bdf - outer joint - why are they floating points now?
pd.merge(adf, bdf, how="outer")

  x1   x2   x3
0  A  1.0    T
1  B  2.0    F
2  C  3.0  NaN
3  D  NaN    T

In [19]:
#appending pandas datafram 
#append dbf and adf (row-wise concatination)

pd.concat([adf, bdf], sort=True)

  x1   x2   x3
0  A  1.0  NaN
1  B  2.0  NaN
2  C  3.0  NaN
0  A  NaN    T
1  B  NaN    F
2  D  NaN    T

In [37]:
# Column-wise concatenation 
# axis: whether we will concatenate along rows (0) or columns (1)
pd.concat([adf, bdf], axis=1)

  x1  x2 x1 x3
0  A   1  A  T
1  B   2  B  F
2  C   3  D  T

In [21]:
# When two dataframes have exactly the same columns

In [26]:
df = pd.DataFrame([[1, 2]], columns = ['a', 'b'])
df2 = pd.DataFrame([[5, 6]], columns = ['a', 'b'])

df = df.append(df2, ignore_index=True)

In [27]:
df

   a  b
0  1  2
1  5  6

In [41]:
# Pandasâ€™ merge and concat can be used to combine subsets of a DataFrame, or even data from different files.
# join function combines DataFrames based on index or column.
# Joining two DataFrames can be done in multiple ways (left, right, and inner) depending on what data must be in the final DataFrame.

In [42]:
# Slicing dataframe based on largest value for a specific column

In [43]:
import numpy as np

df = pd.DataFrame({'a': [1, 10, 8, 11, -1], 'b': list('abcde'), 'c':[1.0, 2.0, np.nan, 3.0, 4.0]})

In [44]:
df

    a  b    c
0   1  a  1.0
1  10  b  2.0
2   8  c  NaN
3  11  d  3.0
4  -1  e  4.0

In [45]:
# How many NaN values for column C
df['c'].isnull().sum()

1

In [46]:
df.isnull().sum()

a    0
b    0
c    1
dtype: int64

In [47]:
# Select the three largest values from column 'a'. 
# Keep only the values in columns 'b' and 'c' that are in the same row as the 3 largest values in 'a'
df.nlargest(3, 'a')

    a  b    c
3  11  d  3.0
1  10  b  2.0
2   8  c  NaN

In [48]:
# calculate the number of null values in column 'c'
df['c'].isnull().sum()

1

In [40]:
# calculate the number of null values in the dataframe
df.isnull().sum()

a    0
b    0
c    1
dtype: int64

In [ ]:
#using the melt method in Pandas